ЧартерEDT.Расширение1/src/DataProcessors/чартер_ЗаполнениеСправочникаПосадочныхМест/чартер_ЗаполнениеСправочникаПосадочныхМест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>чартер_ЗаполнениеСправочникаПосадочныхМест</name>
</mdclass:DataProcessor>

ЧартерEDT.Расширение1/src/Enums/чартер_ТипВСРассадка/чартер_ТипВСРассадка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>чартер_ТипВСРассадка</name>
  <enumValues>
    <name>Boeing763_290PAX</name>
  </enumValues>
  <enumValues>
    <name>Boeing763_235PAX</name>
  </enumValues>
  <enumValues>
    <name>Boeing763_189PAX</name>
  </enumValues>
</mdclass:Enum>

ЧартерEDT.Расширение1/src/Catalogs/чартер_ПосадочныеМестаНаРейс/чартер_ПосадочныеМестаНаРейс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>чартер_ПосадочныеМестаНаРейс</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Класс</name>
    <type>
      <types>EnumRef.чартер_КлассыМестВС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоСообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнфоАктивно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КомпоновкаВС</name>
    <type>
      <types>EnumRef.чартер_ТипВСРассадка</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЧартерEDT.Расширение1/src/DataProcessors/чартер_ЗаполнениеСправочникаПосадочныхМест/Forms/Form/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Procedure СформироватьМеста(Command)
	
	Очиститьсообщения();
	СформироватьНаСервере();	
	
EndProcedure

&НаКлиенте
Процедура ЗаполнитьКомпоновку(Команда)
	
	ЗаполнитьКомпоновкуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформироватьНаСервере()

	Счетчик = НачалоРяда;	
	ПоследнееМестоВРяду = КонецРяда;
	
	Пока Счетчик <= ПоследнееМестоВРяду Цикл
		
		СпрОбъект = Справочники.чартер_ПосадочныеМестаНаРейс.СоздатьЭлемент();     
		СпрОбъект.Наименование = Строка(Счетчик) + НаименованиеРяда;
		СпрОбъект.Класс = Класс;
		СпрОбъект.КомпоновкаВС = КомпоновкаВС;
		
		Счетчик = Счетчик + 1; 
		СпрОбъект.Записать();		
		
	КонецЦикла;   
		
	чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю("Готово");	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКомпоновкуНаСервере()
	
	Запрос = Новый запрос;
	Запрос.Текст =
					"ВЫБРАТЬ
					|	чартер_ПосадочныеМестаНаРейс.Ссылка КАК Ссылка
					|ИЗ
					|	Справочник.чартер_ПосадочныеМестаНаРейс КАК чартер_ПосадочныеМестаНаРейс
					|ГДЕ
					|	НЕ чартер_ПосадочныеМестаНаРейс.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		СпрОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();  
		Если СпрОбъект.IsFolder Тогда
			Продолжить;
		Иначе	
			СпрОбъект.КомпоновкаВС = Перечисления.чартер_ТипВСРассадка.Boeing763_290PAX;
			СпрОбъект.Записать(); 
		КонецЕсли;
	КонецЦикла; 
	
	чартеры_ОбщиеПроцедурыИФункцииСервер.СообщитьПользователю("Готово");
	
КонецПроцедуры

#КонецОбласти
